<?php

$a = 5;
$b = 3;
$c1 = 0;
$c2 = 0;
$c3 = 0;
$c4 = 0;
$c5 = 0;

$c1 = $a + $b;
$c2 = $a - $b;
$c3 = $a * $b;
$c4 = $a / $b;
$c5 = $a & $b;

echo "산술연산자 <br/>";
echo "a + b는 {$c1} 입니다.<br/>";
echo "a - b는 {$c2} 입니다.<br/>";
echo "a * b는 {$c3} 입니다.<br/>";
echo "a / b는 {$c4} 입니다.<br/>";
echo "a / b의 나머지는 {$c5} 입니다.<br/>";

echo "---------------------------------------------------<br/>";

echo "증감연산자 <br/>";
echo "++a 는". ++$a ."입니다.<br/>";
echo "--a 는". --$a ."입니다.<br/>";
echo "a++ 는". $a++ ."입니다.<br/>";
echo "a-- 는". $a-- ."입니다.<br/>";
echo $a;

?>